#Задача 1
#a = int(input("Введите число 1: "))
#b = int(input("Введите число 2: "))
#print(a+b)

#Задача 2

#a = int(input("Введите число 1: "))
#b = int(input("Введите число 2: "))
#c = int(input("Введите число 3: "))
#if a <= b <= c:
  #  print(a, b, c)

#elif a >= b >= c:
    #print(c, b, a)

#elif b >= a >= c:
   # print(c, a, b)

#elif a <= c <= b:
   # print(a, c, b)

#elif b <= a <= c:
   # print(b, c, a)

#else:
   # print(b, c, a)

# Задача № 3
#n = int(input("Введите число: "))
#i = 2
#while i < n:
   # i += 2
   # if i > n:
       # break
    #print(i)
# Задача 4
#n = int(input("Введите число: "))
#i = 1
#while i <= n:
    #i += 1
   # if n % i != 0:
     #   continue
    #print(i)

  # Задача 5
#my_list = [int(input("Введите чилсло: ")), int(input("Введите чилсло: ")), int(input("Введите чилсло: ")), int(input("Введите чилсло: ")), int(input("Введите чилсло: ")), int(input("Введите чилсло: "))]
#i = -1
#while i < len(my_list):
#    i += 1
#     if i == len(my_list):
#        continue
#    print((my_list[i]) ** 2)

  # Задача 6
#my_list = [int(input("Введите чилсло: ")), int(input("Введите чилсло: ")), int(input("Введите чилсло: ")), int(input("Введите чилсло: ")), int(input("Введите чилсло: ")), int(input("Введите чилсло: "))]
#i = -1
#while i < len(my_list):
#   i += 1
#    if i == len(my_list):
#        continue
#    elif my_list[i] % 2 != 0:
#        continue
#    print(my_list[i])

